cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'madebymany/custom'
tap 'caskroom/fonts'

cask 'xquartz'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'neovim'
brew 'appalling'
brew 'ffmpeg'
brew 'git'
brew 'imagemagick'
brew 'moltar'
brew 'awscli'
brew 'fzf'
brew 'zsh'
brew 'pyenv-virtualenvwrapper'

cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'vlc'
cask 'docker'
cask 'karabiner'
cask 'karabiner-elements'
cask 'captain'
cask 'dropbox'
cask 'google-drive-file-stream'
cask 'iterm2'
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
